import { Tag } from '@/components/Tag'

export const description =
  'Mange your secrets and environment variables with the Phase CLI'

<Tag variant="small">CLI</Tag>

# Commands and usage

```
> phase

Securely manage and sync environment variables with Phase.

‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚¢†‚†î‚†ã‚£≥‚£ñ‚†ö‚£≤‚¢ñ‚†ô‚†≥‚°Ñ‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä
‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚°¥‚†â‚¢Ä‚°º‚†É‚¢ò‚£û‚†Å‚†ô‚°Ü‚†Ä‚†ò‚°Ü‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä
‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚¢Ä‚°ú‚†Å‚¢†‚†û‚†Ä‚¢†‚†û‚†∏‚°Ü‚†Ä‚†π‚°Ñ‚†Ä‚†π‚°Ñ‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä
‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚¢Ä‚†û‚†Ä‚¢†‚†è‚†Ä‚£†‚†è‚†Ä‚†Ä‚¢≥‚†Ä‚†Ä‚¢≥‚†Ä‚†Ä‚¢ß‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä
‚†Ä‚†Ä‚†Ä‚†Ä‚¢†‚†é‚†Ä‚£†‚†è‚†Ä‚£∞‚†É‚†Ä‚†Ä‚†Ä‚†à‚£á‚†Ä‚†ò‚°á‚†Ä‚†ò‚°Ü‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä
‚†Ä‚†Ä‚†Ä‚¢†‚†è‚†Ä‚£∞‚†á‚†Ä‚£∞‚†É‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚¢∫‚°Ä‚†Ä‚¢π‚†Ä‚†Ä‚¢Ω‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä
‚†Ä‚†Ä‚¢†‚†è‚†Ä‚£∞‚†É‚†Ä‚£∞‚†É‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚£á‚†Ä‚†à‚£á‚†Ä‚†ò‚°á‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä
‚†Ä‚¢†‚†è‚†Ä‚¢∞‚†É‚†Ä‚£∞‚†É‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚¢∏‚°Ä‚†Ä‚¢π‚°Ä‚†Ä‚¢π‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä
‚¢†‚†è‚†Ä‚¢∞‚†É‚†Ä‚£∞‚†É‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚£á‚†Ä‚†à‚£á‚†Ä‚†à‚°á‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä
‚†õ‚†í‚†ö‚†õ‚†í‚†ì‚†ö‚†í‚†í‚†ì‚†í‚†ì‚†ö‚†í‚†ì‚†ö‚†í‚†ì‚¢ª‚°í‚†í‚¢ª‚°í‚†í‚¢ª‚°í‚†í‚†í‚†í‚†í‚†í‚†í‚†í‚†í‚†í‚£≤‚†í‚†í‚£≤‚†í‚†í‚°≤‚†Ä‚†Ä‚†Ä‚†Ä
‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚¢ß‚†Ä‚†Ä‚¢ß‚†Ä‚†à‚£á‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚¢†‚†á‚†Ä‚£∞‚†É‚†Ä‚£∞‚†É‚†Ä‚†Ä‚†Ä‚†Ä
‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†ò‚°Ü‚†Ä‚†ò‚°Ü‚†Ä‚†∏‚°Ñ‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚£†‚†á‚†Ä‚£∞‚†É‚†Ä‚£¥‚†É‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä
‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†π‚°Ñ‚†Ä‚†π‚°Ñ‚†Ä‚†π‚°Ñ‚†Ä‚†Ä‚†Ä‚†Ä‚°¥‚†É‚¢Ä‚°º‚†Å‚¢Ä‚°º‚†Å‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä
‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†ô‚£Ü‚†Ä‚†ô‚£Ü‚†Ä‚†π‚£Ñ‚†Ä‚£†‚†é‚†Å‚£†‚†û‚†Ä‚°§‚†è‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä
‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†à‚†≥‚¢§‚£à‚£≥‚£§‚£º‚£π‚¢•‚£∞‚£ã‚°•‚°¥‚†ä‚†Å‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä‚†Ä

options:
  -h, --help            show this help message and exit
  --version, -v         show program's version number and exit

Commands:
  {auth,init,run,secrets,logout,console,update,keyring}
    auth                üíª Authenticate with Phase
    init                üîó Link your project to your Phase app
    run                 üöÄ Run and inject secrets to your app
    secrets             üóùÔ∏è Manage your secrets
    logout              üèÉ Logout from phase-cli
    console             üñ•Ô∏è Open the Phase Console in your browser
    update              üîÑ Update the Phase CLI to the latest version
    keyring             üîê Display information about the Phase keyring
```

## Available commands {{ className: 'lead' }}

To use Phase CLI, simply run:

```fish
> phase [command] [sub-command] [options]
```

To view all available commands and their descriptions, run:

```fish
> phase --help
```

```fish
> phase secrets -h
```

---

## `auth`

Authenticate with Phase. If you using the cli on your own machines you can use `phase auth` to login to Phase Cloud or your own Self-hosted instance.

You can get a Phase User token in [Phase Console](https://console.phase.dev) -> Apps -> Tokens -> User tokens

```
¬ª phase auth
? Choose your Phase instance type: (Use arrow keys)
 ¬ª ‚òÅÔ∏è Phase Cloud
   üõ†Ô∏è Self Hosted
```

You will have to provide the credentials:

- Host URL - *Only for Self-hosted instances*
- Email
- Phase User token

Note: If you are running the CLI in an headless environment (eg. CI/CD, Docker container, bash script) you can use pass the `PHASE_HOST` and `PHASE_SERVICE_TOKEN` environment variable. See [Environment Variable](commands#environment-variables) for more details.

---

## `init`

Link your local project to your Phase app.

Usage:

```fish
> phase init
```

Example:

```fish
> phase init
? Select an App: [use arrow keys]

   ferrari
 ¬ª keyspace
   inception
   Exit

> phase init
? Select an App: keyspace
‚úÖ Initialization completed successfully.
```

This would create a Phase application config in your projects working directly:

```fish
> cat .phase.json
{
  "version": "1",
  "phaseApp": "keyspace",
  "appId": "511f26b7-5b56-47f3-920e-a4edb9cdbf3c",
  "defaultEnv": "Development"
}
```

**Tip**: You can manually set the default environment context for the Phase CLI by modifying the `defaultEnv`. Eg. `"defaultEnv": "Production"`

---

## `run`

Run and inject secrets into your app.

Usage:

```fish
> phase run [command_to_run] [--env ENVIRONMENT]
```

- `command_to_run`: The command you wish to run. For example: `yarn dev`.
- `--env`: (Optional) Specify the environment (e.g., `dev`, `staging`, `production`).


Examples:

```fish
> phase run yarn dev
```

```fish
> phase run --env dev "printenv | grep DJANGO_SECRET_KEY"
DJANGO_SECRET_KEY=7842cc89c5a703acdf4797e0f063e1851734cea0677ad9382158cfcee26195df
```

Injecting [Referenced secrets](/cli/commands#secret-referencing):


```fish
> phase secrets get PROD_AWS_KEY --env dev
KEY üóùÔ∏è                | VALUE ‚ú®                                                          
----------------------------------------------------------------------------------------
PROD_AWS_KEY         | ‚õìÔ∏è` ${prod.AWS_ACCESS_KEY_ID}                                    

> phase run --env dev "printenv | grep PROD_AWS_KEY"
PROD_AWS_KEY=AKIA2OGYBAH63UA3VNFG

# In the event a user doesn't have access to prod / production environment
> phase run --env dev "printenv | grep PROD_AWS_KEY"
‚ö†Ô∏è Warning: The environment 'prod' for key 'PROD_AWS_KEY' either does not exist or you do not have access to it. Reference AWS_ACCESS_KEY_ID not found. Ignoring...
PROD_AWS_KEY=
```

Chaining multiple commands:

```fish
> phase run --env prod "python manage.py migrate && python manage.py runserver backend:8000"
```


---

## `secrets`

Manage your secrets. This command has several sub-commands.

#### a. `list`

List all the secrets.

Usage:

```fish
> phase secrets list [--show] [--env ENVIRONMENT]
```

- `--show`: Display secrets uncensored.
- `--env`: (Optional) Specify the environment.

Example:

```fish
phase secrets list --env prod --show
KEY üóùÔ∏è                   | VALUE ‚ú®
-------------------------------------------------------------------------------------------------
DJANGO_SECRET_KEY        | 7842cc89c5a703acdf4797e0f063e1851734cea0677ad9382158cfcee26195df
DJANGO_DEBUG             | True
DB_NAME                  | XP1_LM
DB_USER                  | j_mclaren
DB_PASSWORD              | 6c37810ec6e74ec3228416d2844564fceb99ebd94b29f4334c244db011630b0e
DB_HOST                  | mc-laren-prod-db.c9ufzjtplsaq.us-west-1.rds.amazonaws.com
DB_PORT                  | 5432
```

#### b. `get`

Retrieve a specific secret by key.

Usage:

```fish
> phase secrets get KEY [--env ENVIRONMENT]
```

- `KEY`: The key associated with the secret to fetch.
- `--env`: (Optional) Specify the environment.

Example:
```fish
> phase secrets get DJANGO_SECRET_KEY
KEY üóùÔ∏è                | VALUE ‚ú®                                                                     
---------------------------------------------------------------------------------------------------
DJANGO_SECRET_KEY    | 38d325eec2020f01556d50dfa12a6d9a31a27e90fa9e3adc22c539ec7d361d73
```

#### c. `create`

Create a new secret.

Usage:

```fish
> phase secrets create [KEY] [--env ENVIRONMENT]
```

- `KEY`: (Optional) The key for the secret to be created.
- `--env`: (Optional) Specify the environment.

```fish
> phase secrets create DEBUG 
Please enter the value (hidden):  # Set to True
KEY üóùÔ∏è                    | VALUE ‚ú®                                                                 
---------------------------------------------------------------------------------------------------                                                          
DEBUG                    | ****                                                                    

ü•Ω To uncover the secrets, use: phase secrets list --show
```

#### d. `update`

Update an existing secret.

Usage:

```fish
> phase secrets update KEY [--env ENVIRONMENT]
```

- `KEY`: The key associated with the secret to update.
- `--env`: (Optional) Specify the environment.

Example:

```fish
> phase secrets update DEBUG 
Please enter the new value for DEBUG (hidden): # Set to False
Successfully updated the secret. 
KEY üóùÔ∏è                    | VALUE ‚ú®                                             
-------------------------------------------------------------------------------
DEBUG                     | *****                                               

ü•Ω To uncover the secrets, use: phase secrets list --show
```

#### e. `delete`

Delete a secret.

Usage:

```fish
> phase secrets delete KEYS... [--env ENVIRONMENT]
```

- `KEYS`: One or more keys to be deleted.
- `--env`: (Optional) Specify the environment.

Example:
```fish
> phase secrets delete DEBUG
Successfully deleted the secrets.
KEY üóùÔ∏è                    | VALUE ‚ú®                                             
-------------------------------------------------------------------------------

ü•Ω To uncover the secrets, use: phase secrets list --show
```

#### f. `import`

Import secrets from a .env file.

Usage:

```fish
> phase secrets import ENV_FILE [--env ENVIRONMENT]
```

- `ENV_FILE`: The `.env` file to import from.
- `--env`: (Optional) Specify the environment.

Example:
```fish
> cat .env
AWS_ACCESS_KEY_ID="AKIA2OGYBAH63UA3VNFG"
AWS_SECRET_ACCESS_KEY="V5yWXDe82Gohf9DYBhpatYZ74a5fiKfJVx8rx6W1"

> phase secrets import .env --env prod
Successfully imported and encrypted 2 secrets.
To view them please run: phase secrets list --env prod

> phase secrets list --env prod
KEY üóùÔ∏è                    | VALUE ‚ú®                                                                  
----------------------------------------------------------------------------------------------------     
AWS_ACCESS_KEY_ID        | AKI**************NFG                                                     
AWS_SECRET_ACCESS_KEY    | V5y**********************************6W1                                 

ü•Ω To uncover the secrets, use: phase secrets list --show

> rm .env
```

#### g. `export`

Export secrets in a dotenv format.

Usage:

```fish
> phase secrets export [KEYS...] [--env ENVIRONMENT]
```

- `KEYS`: (Optional) List of keys separated by space.
- `--env`: (Optional) Specify the environment.

```fish
# Export all the secrets in the production environment
> phase secrets export --env prod
AWS_ACCESS_KEY_ID="AKIA2OGYBAH63UA3VNFG"
AWS_SECRET_ACCESS_KEY="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"

# Export only the AWS_SECRET_ACCESS_KEY in the production environment
> phase secrets export AWS_SECRET_ACCESS_KEY --env prod
AWS_SECRET_ACCESS_KEY="V5yWXDe82Gohf9DYBhpatYZ74a5fiKfJVx8rx6W1"

# Export all secrets in the dev (default) environment and pipe them to a .env file
> phase secrets export > .env.example
> head .env.example 
AWS_SECRET_ACCESS_KEY="V5yWXDe82Gohf9DYBhpatYZ74a5fiKfJVx8rx6W1"
DB_NAME="XP1_LM"
DB_UER="j_mclaren"
DJANGO_SECRET_KEY="38d325eec2020f01556d50dfa12a6d9a31a27e90fa9e3adc22c539ec7d361d73"
DJANGO_DEBUG="True"
DB_PASSWORD="601602017dde26ce94f46748e0fc342b046d4e36f623957b9be94ca4d616076c"
DB_HOST="mc-laren-prod-db.c9ufzjtplsaq.us-west-1.rds.amazonaws.com"
DB_PORT="5432"
DATABASE_URL="postgresql://j_mclaren:601602017dde26ce94f46748e0fc342b046d4e36f623957b9be94ca4d616076c@mc-laren-prod-db.c9ufzjtplsaq.us-west-1.rds.amazonaws.com:5432/XP1_LM"

# In the event a user doesn't have access to prod / production environment
> phase secrets export PROD_AWS_KEY PROD_AWS_SECRET_ACCESS_KEY --env prod
AWS_ACCESS_KEY_ID="AKIA2OGYBAH63UA3VNFGds"
# Warning: The environment 'prod' for key 'PROD_AWS_SECRET_ACCESS_KEY' either does not exist or you do not have access to it.
PROD_AWS_SECRET_ACCESS_KEY=""

```

## Secret referencing

Phase Console and CLI also support dotenv styled secret referencing.

You can set a value of a secret to a value of another by simply pointing to it via the following syntax.

| Environment  | Syntax                   |
| ------------ | ------------------------ |
| **üîó Local** | `${<key>}`               |
| **‚õìÔ∏è Cross** | `${<environment>.<key>}` |

Values prefixed with a `üîó` indicate a local secret being referenced, whereas values prefixed with `‚õìÔ∏è` indicate cross environment secret value being referenced ie. development, staging, prod.

**Examples**:

Local environment secret referencing:

```fish
> phase secrets list --env prod --show
KEY üóùÔ∏è                   | VALUE ‚ú®
-------------------------------------------------------------------------------------------------
DJANGO_SECRET_KEY        | 7842cc89c5a703acdf4797e0f063e1851734cea0677ad9382158cfcee26195df
DJANGO_DEBUG             | True
DB_NAME                  | XP1_LM
DB_USER                  | j_mclaren
DB_PASSWORD              | 6c37810ec6e74ec3228416d2844564fceb99ebd94b29f4334c244db011630b0e
DB_HOST                  | mc-laren-prod-db.c9ufzjtplsaq.us-west-1.rds.amazonaws.com
DB_PORT                  | 5432
DATABASE_URL             | üîó postgresql://${DB_USER}:${DB_PASSWORD}@${DB_HOST}:${DB_PORT}/${DB_NAME}

> phase run "printenv | grep DATABASE_URL"
DATABASE_URL=postgresql://j_mclaren:6c37810ec6e74ec3228416d2844564fceb99ebd94b29f4334c244db011630b0e@mc-laren-prod-db.c9ufzjtplsaq.us-west-1.rds.amazonaws.com:5432/XP1_LM
```

The database connection string `postgresql://` is referencing `DB_USER`, `DB_PASSWORD`, `DB_HOST`, `DB_PORT` and `DB_NAME` from the same environment (dev/development)

Cross environment secret referencing:

```fish
> phase secrets list --env prod --show
KEY üóùÔ∏è                    | VALUE ‚ú®                                          
----------------------------------------------------------------------------
DATABASE_URL              | ‚õìÔ∏è postgresql://${dev.DB_USER}:${dev.DB_PASSWORD}@${dev.DB_HOST}:${dev.DB_PORT}/${dev.DB_NAME}

> phase run --env prod "printenv | grep DATABASE_URL"
DATABASE_URL=postgresql://j_mclaren:6c37810ec6e74ec3228416d2844564fceb99ebd94b29f4334c244db011630b0e@mc-laren-prod-db.c9ufzjtplsaq.us-west-1.rds.amazonaws.com:5432/XP1_LM
```

**Note**: This is assuming an environment named dev/development exists and has a secrets with the keys `AWS_ACCESS_KEY_ID` and `AWS_SECRET_ACCESS_KEY`.

---

## `logout`

Logout from the Phase CLI.

Usage:

```fish
> phase logout [--purge]
```

- `--purge`: Purge all local data.

---

## `console`

Open the Phase Console in your web browser.

Usage:

```fish
> phase console
```

---

## `update`

Update the Phase CLI to the latest version. This subcommand will be only shown on linux systems when the cli is installed via the installation script.

Usage:

```fish
> phase update
```

---

## `keyring`

Display information about the Phase keyring. Phase keyring holds sensitive credentials such as user tokens.

Usage:

```fish
> phase keyring
```

---

## Environment variables

### `PHASE_DEBUG`

Type: Boolean

Description: Set to true to get full tracebacks for error messages

Example:
```fish
> PHASE_DEBUG=True phase secrets list
Exception: üóø Network error: Please check your internet connection. Detail: HTTPConnectionPool(host='localhost', port=443): Max retries exceeded with url: /secrets/tokens/ (Caused by NewConnectionError('<urllib3.connection.HTTPConnection object at 0x7f7c2041d7d0>: Failed to establish a new connection: [Errno 111] Connection refused'))
```

### `PHASE_HOST`

Type: String

Description: A full URL to the REST API of the Phase Service

Example:
```fish
> export PHASE_HOST=https://phase.internal.company.domain.com

> phase secrets export
...
```

### `PHASE_SERVICE_TOKEN`

Type: String

Description: A way to authenticate with the Phase Service via tokens, useful for running the cli in an headless environment like CI/CD, Docker containers etc.

Example:
```fish
> export PHASE_SERVICE_TOKEN=pss_service...

> phase secrets export
...
```

### `PHASE_VERIFY_SSL`

Type: Boolean

Description: A way to temporarily disable TLS certificate verification checks

Note: Disable TLS certificate verification is dangerous and can expose you to risks of [MITM](https://en.wikipedia.org/wiki/Man-in-the-middle_attack) attacks.

Example:
```fish
> export PHASE_VERIFY_SSL=True

> phase secrets export
...
```
